{
  "irVersion": "1.0",
  "project": "marp2video",
  "repository": "https://github.com/grokify/marp2video",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Automatic subtitle generation with STT (Speech-to-Text) support" },
        { "description": "OmniVoice integration for unified TTS/STT provider abstraction" },
        { "description": "Dictionary-based case correction for proper noun capitalization in subtitles" }
      ],
      "added": [
        { "description": "Subtitle generator with STT support for automatic caption generation", "commit": "159f95e" },
        { "description": "`subtitle` CLI command for generating subtitles from audio", "commit": "83c726d" },
        { "description": "`stt` CLI command for speech-to-text transcription", "commit": "83c726d" },
        { "description": "Subtitle embedding support (soft subtitles) via ffmpeg", "commit": "452f30a" },
        { "description": "Subtitle burning support (hard-coded subtitles) via ffmpeg", "commit": "452f30a" },
        { "description": "Dictionary-based case correction with built-in tech terms", "commit": "7b9f193" },
        { "description": "Custom dictionary support via JSON files", "commit": "7b9f193" },
        { "description": "OmniVoice TTS provider wrapper for unified interface", "commit": "6aebc4c" },
        { "description": "OmniVoice STT provider wrapper for unified interface", "commit": "6aebc4c" },
        { "description": "TTS provider override and provider-specific settings clearing", "commit": "629de16" },
        { "description": "Path sanitization for safe ffmpeg subprocess execution", "commit": "35aef8d" }
      ],
      "changed": [
        { "description": "Refactored orchestrator and audio player for OmniVoice integration", "commit": "d975709" }
      ],
      "tests": [
        { "description": "Added subtitle alignment tests", "commit": "5b95ad3" }
      ],
      "documentation": [
        { "description": "Added complete workflow guide: Marp to video with subtitles", "commit": "256a4c4" },
        { "description": "Added subtitle generation features to README", "commit": "11c384b" },
        { "description": "Added subtitle guide and dual-language TRD", "commit": "dd29c85" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` to v0.73.2 for `SanitizePath` support", "commit": "35aef8d" },
        { "description": "Add `github.com/agentplexus/omnivoice` for unified TTS/STT abstraction", "commit": "7c1b9cd" },
        { "description": "Add `github.com/agentplexus/omnivoice-deepgram` for Deepgram STT", "commit": "7c1b9cd" }
      ],
      "chore": [
        { "description": "Update Go versions in CI", "commit": "171ab0b" },
        { "description": "Update module dependencies", "commit": "004176a" },
        { "description": "Fix lint errors and apply gofmt", "commit": "785d2e4" },
        { "description": "Add intro example audio files", "commit": "309916d" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-02-09",
      "highlights": [
        { "description": "Convert Marp presentations to narrated videos with AI-generated voiceovers" },
        { "description": "Multi-language transcript support with ElevenLabs TTS integration" },
        { "description": "Image-based video generation for reliable, high-quality output" }
      ],
      "added": [
        { "description": "CLI tool with `tts` and `video` subcommands", "commit": "789cc47" },
        { "description": "Marp markdown parser with voiceover comment extraction (`<!-- voiceover: ... -->`)", "commit": "789cc47" },
        { "description": "Pause directive support (`<!-- pause: 500 -->`) for timing control", "commit": "789cc47" },
        { "description": "ElevenLabs TTS integration for audio generation", "commit": "789cc47" },
        { "description": "Multi-language transcript package with JSON schema", "commit": "517e554" },
        { "description": "Support for BCP-47 locale codes (en-US, es-ES, zh-Hans, fr-FR, etc.)", "commit": "3cd26aa" },
        { "description": "`tts` subcommand for generating audio from transcript.json files", "commit": "c351853" },
        { "description": "TTS resume support with `--force` flag to skip existing audio files", "commit": "48776f3" },
        { "description": "Audio manifest for tracking generated files and durations", "commit": "c351853" },
        { "description": "Image-based video generation using Marp PNG export", "commit": "d8b963c" },
        { "description": "Video combining with optional crossfade transitions", "commit": "789cc47" },
        { "description": "Individual slide video export for platforms like Udemy", "commit": "789cc47" },
        { "description": "Progress bar during conversion with multi-stage tracking", "commit": "60e3d46" },
        { "description": "`--verbose` flag for debug logging", "commit": "30c69a1" },
        { "description": "Cross-platform support: macOS, Linux, Windows", "commit": "789cc47" },
        { "description": "Self-documenting intro example with 13 slides", "commit": "c88bf10" },
        { "description": "Simplified Chinese and French translations for intro example", "commit": "0d40cc1" }
      ],
      "fixed": [
        { "description": "Nil pointer dereference with slog logger", "commit": "a593129" },
        { "description": "Browser timeout issues during recording", "commit": "a593129" },
        { "description": "Screen device auto-detection on macOS", "commit": "a593129" }
      ],
      "documentation": [
        { "description": "Comprehensive README with installation, usage, and troubleshooting", "commit": "f84f250" },
        { "description": "MkDocs documentation site", "commit": "325ae0d" },
        { "description": "macOS screen recording permissions guide", "commit": "08b22c3" },
        { "description": "Example presentation with OmniVoice TTS workflow", "commit": "981fd68" }
      ],
      "dependencies": [
        { "description": "`github.com/go-rod/rod` for browser automation", "commit": "789cc47" },
        { "description": "`github.com/spf13/cobra` for CLI framework", "commit": "789cc47" },
        { "description": "`github.com/grokify/mogo` for utilities and progress bars", "commit": "789cc47" }
      ]
    }
  ]
}
