{
  "irVersion": "1.0",
  "project": "videoascode",
  "repository": "https://github.com/grokify/videoascode",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.5.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Migrate to batteries-included plexusone/omnivoice with provider registry pattern" }
      ],
      "changed": [
        { "description": "Use omnivoice registry pattern (`GetSTTProvider`, `GetTTSProvider`) instead of direct provider imports", "commit": "35210ce" },
        { "description": "Providers auto-registered via `_ \"github.com/plexusone/omnivoice/providers/all\"`", "commit": "35210ce" }
      ],
      "dependencies": [
        { "description": "Upgrade `github.com/plexusone/omnivoice` from v0.1.0 to v0.5.1 (batteries-included)", "commit": "35210ce" },
        { "description": "Remove direct imports of `go-elevenlabs` and `omnivoice-deepgram` (now indirect via omnivoice)", "commit": "35210ce" }
      ],
      "documentation": [
        { "description": "Update README to reference `plexusone/omnivoice` instead of `agentplexus/omnivoice`", "commit": "35210ce" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-02-21",
      "highlights": [
        { "description": "Project renamed to VideoAsCode with new `vac` CLI" },
        { "description": "Breaking change: Module path changed to `github.com/grokify/videoascode`" }
      ],
      "breaking": [
        { "description": "Project renamed from `marp2video` to `videoascode`", "commit": "e339358" },
        { "description": "CLI renamed from `marp2video` to `vac`", "commit": "e339358" },
        { "description": "Go module path changed to `github.com/grokify/videoascode`", "commit": "e339358" },
        { "description": "Config directory changed from `~/.config/marp2video/` to `~/.config/videoascode/`", "commit": "e339358" }
      ],
      "changed": [
        { "description": "Refactored to use `ffutil` package for FFmpeg/FFprobe operations", "commit": "531049a" }
      ],
      "documentation": [
        { "description": "Added known limitations section for v0.3.0", "commit": "0161213" },
        { "description": "Updated all documentation with new project name and CLI commands", "commit": "e339358" }
      ],
      "chore": [
        { "description": "Remove scroll debug output from browser package", "commit": "d04e9f5" },
        { "description": "Update module dependencies", "commit": "0de7068" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-02-21",
      "highlights": [
        { "description": "Browser video recording with automated browser interactions and synchronized voiceover" },
        { "description": "Hardware-accelerated encoding via VideoToolbox on macOS" },
        { "description": "Subtitle burning with --subtitles-burn flag" },
        { "description": "Multi-language pace-to-longest for synchronized video output" }
      ],
      "added": [
        { "description": "Browser automation package (`pkg/browser`) with Rod-based recording", "commit": "387d262" },
        { "description": "Segment abstraction layer (`pkg/segment`) for unified content handling", "commit": "c0c4c5f" },
        { "description": "Source loading package (`pkg/source`) for config and transcript files", "commit": "1875d5c" },
        { "description": "Unified configuration package (`pkg/config`) with YAML support", "commit": "6fb9899" },
        { "description": "Video provider pattern (`pkg/video/provider.go`) for extensible video generation", "commit": "f59c595" },
        { "description": "Media duration utilities (`pkg/media`) for audio/video duration detection", "commit": "650ec47" },
        { "description": "Segment orchestrator for coordinating TTS, video, and audio combination", "commit": "8f25d51" },
        { "description": "TTS support for browser segments with per-step voiceovers", "commit": "ffca154" },
        { "description": "Browser step types: navigate, click, input, scroll, wait, hover, keypress, evaluate", "commit": "387d262" },
        { "description": "Click-by-text-content with textMatch modes (contains, exact, regex)", "commit": "387d262" },
        { "description": "Scroll modes: relative (delta) and absolute (position)", "commit": "289960b" },
        { "description": "Scroll behavior: auto (instant) and smooth (animated with auto-wait)", "commit": "289960b" },
        { "description": "Hardware-accelerated encoding via `--fast` flag (VideoToolbox on macOS)", "commit": "53512f4" },
        { "description": "Subtitle burning via `--subtitles-burn` flag", "commit": "7950ac8" },
        { "description": "Silent video generation via `--no-audio` flag", "commit": "7950ac8" },
        { "description": "Testing flags `--limit` and `--limit-steps` for partial content generation", "commit": "7950ac8" },
        { "description": "Multi-language pace-to-longest for synchronized video timing", "commit": "8f25d51" },
        { "description": "Browser video guide with complete documentation", "commit": "00189c6" },
        { "description": "Example browser demo configs in `examples/browser-demo/`", "commit": "00189c6" }
      ],
      "changed": [
        { "description": "CLI refactored with `browser video` subcommand", "commit": "7950ac8" },
        { "description": "Transcript schema extended with BrowserStep and SourceType fields", "commit": "289960b" }
      ],
      "documentation": [
        { "description": "Added browser video recording guide", "commit": "00189c6" },
        { "description": "Added language duration comparison table to multi-language guide", "commit": "7fa2885" },
        { "description": "Added step duration guidelines to browser video guide", "commit": "7fa2885" },
        { "description": "Updated CLI reference with browser commands and new flags", "commit": "745b9ca" },
        { "description": "Updated README with browser video features", "commit": "de162c7" }
      ],
      "dependencies": [
        { "description": "Add `google/uuid` as direct dependency", "commit": "8c4fc83" },
        { "description": "Add `gopkg.in/yaml.v3` for YAML config parsing", "commit": "8c4fc83" }
      ]
    },
    {
      "version": "v0.2.1",
      "date": "2026-02-15",
      "highlights": [
        { "description": "Mixed audio sample rate support for multi-provider TTS workflows" }
      ],
      "fixed": [
        { "description": "Video concatenation now handles mixed audio sample rates from different TTS providers (e.g., ElevenLabs at 44100 Hz, Deepgram at 22050 Hz) using filter_complex concat instead of demuxer concat", "commit": "68d5976" },
        { "description": "Debug mode (`MARP2VIDEO_DEBUG=1`) no longer causes 'Stdout already set' error", "commit": "68d5976" }
      ],
      "tests": [
        { "description": "`TestCombineVideos_SingleVideo` for single video passthrough", "commit": "fa5fe3f" },
        { "description": "`TestCombineVideos_FilterComplexConcat` documenting concat approach", "commit": "fa5fe3f" },
        { "description": "`TestMixedAudioSampleRates_Documentation` explaining sample rate handling", "commit": "fa5fe3f" },
        { "description": "`TestNewImageVideoConverter` and `TestDebugModeEnvironmentVariable` for image video converter", "commit": "fa5fe3f" }
      ],
      "documentation": [
        { "description": "Added `--subtitles` and `--subtitles-lang` flags to video command in README", "commit": "0f49569" },
        { "description": "Updated complete workflow guide with subtitle embedding instructions", "commit": "859df01" },
        { "description": "Added troubleshooting guide with common issues and solutions", "commit": "fa5fe3f" },
        { "description": "Updated architecture docs with mixed audio sample rate handling details", "commit": "fa5fe3f" }
      ],
      "dependencies": [
        { "description": "Upgrade `github.com/plexusone/omnivoice` to v0.4.3 for subtitle line count fix and Chinese/English subtitle tests", "commit": "c852036" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "Automatic subtitle generation with STT (Speech-to-Text) support" },
        { "description": "OmniVoice integration for unified TTS/STT provider abstraction" },
        { "description": "Dictionary-based case correction for proper noun capitalization in subtitles" }
      ],
      "added": [
        { "description": "Subtitle generator with STT support for automatic caption generation", "commit": "159f95e" },
        { "description": "`subtitle` CLI command for generating subtitles from audio", "commit": "83c726d" },
        { "description": "`stt` CLI command for speech-to-text transcription", "commit": "83c726d" },
        { "description": "Subtitle embedding support (soft subtitles) via ffmpeg", "commit": "452f30a" },
        { "description": "Subtitle burning support (hard-coded subtitles) via ffmpeg", "commit": "452f30a" },
        { "description": "Dictionary-based case correction with built-in tech terms", "commit": "7b9f193" },
        { "description": "Custom dictionary support via JSON files", "commit": "7b9f193" },
        { "description": "OmniVoice TTS provider wrapper for unified interface", "commit": "6aebc4c" },
        { "description": "OmniVoice STT provider wrapper for unified interface", "commit": "6aebc4c" },
        { "description": "TTS provider override and provider-specific settings clearing", "commit": "629de16" },
        { "description": "Path sanitization for safe ffmpeg subprocess execution", "commit": "35aef8d" }
      ],
      "changed": [
        { "description": "Refactored orchestrator and audio player for OmniVoice integration", "commit": "d975709" }
      ],
      "tests": [
        { "description": "Added subtitle alignment tests", "commit": "5b95ad3" }
      ],
      "documentation": [
        { "description": "Added complete workflow guide: Marp to video with subtitles", "commit": "256a4c4" },
        { "description": "Added subtitle generation features to README", "commit": "11c384b" },
        { "description": "Added subtitle guide and dual-language TRD", "commit": "dd29c85" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/grokify/mogo` to v0.73.2 for `SanitizePath` support", "commit": "35aef8d" },
        { "description": "Add `github.com/plexusone/omnivoice` for unified TTS/STT abstraction", "commit": "7c1b9cd" },
        { "description": "Add `github.com/plexusone/omnivoice-deepgram` for Deepgram STT", "commit": "7c1b9cd" }
      ],
      "chore": [
        { "description": "Update Go versions in CI", "commit": "171ab0b" },
        { "description": "Update module dependencies", "commit": "004176a" },
        { "description": "Fix lint errors and apply gofmt", "commit": "785d2e4" },
        { "description": "Add intro example audio files", "commit": "309916d" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-02-09",
      "highlights": [
        { "description": "Convert Marp presentations to narrated videos with AI-generated voiceovers" },
        { "description": "Multi-language transcript support with ElevenLabs TTS integration" },
        { "description": "Image-based video generation for reliable, high-quality output" }
      ],
      "added": [
        { "description": "CLI tool with `tts` and `video` subcommands", "commit": "789cc47" },
        { "description": "Marp markdown parser with voiceover comment extraction (`<!-- voiceover: ... -->`)", "commit": "789cc47" },
        { "description": "Pause directive support (`<!-- pause: 500 -->`) for timing control", "commit": "789cc47" },
        { "description": "ElevenLabs TTS integration for audio generation", "commit": "789cc47" },
        { "description": "Multi-language transcript package with JSON schema", "commit": "517e554" },
        { "description": "Support for BCP-47 locale codes (en-US, es-ES, zh-Hans, fr-FR, etc.)", "commit": "3cd26aa" },
        { "description": "`tts` subcommand for generating audio from transcript.json files", "commit": "c351853" },
        { "description": "TTS resume support with `--force` flag to skip existing audio files", "commit": "48776f3" },
        { "description": "Audio manifest for tracking generated files and durations", "commit": "c351853" },
        { "description": "Image-based video generation using Marp PNG export", "commit": "d8b963c" },
        { "description": "Video combining with optional crossfade transitions", "commit": "789cc47" },
        { "description": "Individual slide video export for platforms like Udemy", "commit": "789cc47" },
        { "description": "Progress bar during conversion with multi-stage tracking", "commit": "60e3d46" },
        { "description": "`--verbose` flag for debug logging", "commit": "30c69a1" },
        { "description": "Cross-platform support: macOS, Linux, Windows", "commit": "789cc47" },
        { "description": "Self-documenting intro example with 13 slides", "commit": "c88bf10" },
        { "description": "Simplified Chinese and French translations for intro example", "commit": "0d40cc1" }
      ],
      "fixed": [
        { "description": "Nil pointer dereference with slog logger", "commit": "a593129" },
        { "description": "Browser timeout issues during recording", "commit": "a593129" },
        { "description": "Screen device auto-detection on macOS", "commit": "a593129" }
      ],
      "documentation": [
        { "description": "Comprehensive README with installation, usage, and troubleshooting", "commit": "f84f250" },
        { "description": "MkDocs documentation site", "commit": "325ae0d" },
        { "description": "macOS screen recording permissions guide", "commit": "08b22c3" },
        { "description": "Example presentation with OmniVoice TTS workflow", "commit": "981fd68" }
      ],
      "dependencies": [
        { "description": "`github.com/go-rod/rod` for browser automation", "commit": "789cc47" },
        { "description": "`github.com/spf13/cobra` for CLI framework", "commit": "789cc47" },
        { "description": "`github.com/grokify/mogo` for utilities and progress bars", "commit": "789cc47" }
      ]
    }
  ]
}
